# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'romkatv/powerlevel10k'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
cask 'postman'
cask 'mactex'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "pulumi"
brew 'kind'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# ibrew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
# brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'
brew 'temporal'

# Apps
# cask '1password'
# cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
cask 'docker'
# cask 'figma'
# cask 'firefox'
# cask 'github'
# cask 'google-chrome'
# cask 'helo'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'phpmon'
# cask 'ray'
# cask 'raycast'
# cask 'readdle-spark'
# cask 'screenflow'
cask 'slack'
# cask 'tableplus'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
# cask 'zwift'
cask 'macdown'

# java
cask 'intellij-idea-ce'
brew 'maven'
brew 'gradle'
# cask 'temurin'
cask 'temurin19'
brew 'scala'
brew 'micronaut'
brew 'jenv'

# kubernetes
# cask 'kubectl'
# cask 'minikube'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'
cask 'atom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"


# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
